[
    {
      "title": "GO Super Heroes Guardians of the Galaxy Advent Calendar 76231",
      "supplier": " LEGO Systems Inc.",


      "description": "NEW YORK TIMES BESTSELLER • GOOD MORNING AMERICA BOOK CLUB PICK • A must-read debut! Meet Elizabeth Zott: a “formidable, unapologetic and inspiring” (PARADE) scientist in 1960s California whose career takes a detour when she becomes the unlikely star of a beloved TV cooking show in this novel that is “irresistible, satisfying and full of fuel. It reminds you that change takes time and always requires heat” (The New York Times Book Review).'A unique heroine ... you'll find yourself wishing she wasn’t fictional.' —Seattle Times Chemist Elizabeth Zott is not your average woman. In fact, Elizabeth Zott would be the first to point out that there is no such thing as an average woman. But it’s the early 1960s and her all-male team at Hastings Research Institute takes a very unscientific view of equality. Except for one: Calvin Evans; the lonely, brilliant, Nobel–prize nominated grudge-holder who falls in love with—of all things—her mind. True chemistry results. ",
      
     
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0810558017395_p0_v9%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 13.99,
      "stock":120 ,
      "discount": 5.3,
      "rating": 5,
      "reviews": [
        {
          "userEmail": "shahin@gmail.com",
          "name": "shahin",
          "review": "A favorite of 2022, Lessons in Chemistry is incredibly smart and entertaining, yet also filled with so much heart. You will ADORE the main character and her very unique brain",
          "rating":4.5
        }
      ]
    },
    {
      "title": "12 Stick Man Plush Toy",
      "supplier": "by Iman Hariri-Kia",
      

      "description": "So when she lands a highly coveted job as assistant to Loretta James, Vinyl's iconic editor-in-chief, Noora can't believe her luck. Her only dream is to write for Vinyl, and now with her foot firmly in the door and the Loretta James as her mentor, Noora is finally on the right path... or so she thinks.Loretta is an unhinged nightmare, insecure and desperate to remain relevant in an evolving media landscape she doesn't understand. Noora's phone buzzes constantly with Loretta's bizarre demands, particularly with tasks Loretta hopes will undermine the success of Vinyl's wunderkind digital director Jade Aki. The reality of Noora's job is nothing like she expected, and a misguided crush on the hot IT guy only threatens to complicate things even more. But as Loretta and the old-school print team enter into a turf war with Jade and the woke-for-the-wrong-reasons digital team, Noora soon finds herself caught in the middle. And with her dream job on the line, she'll need to either choose a side or form her own.Clever, incisive, and thoroughly fun, A Hundred Other Girls is an insider's take on the changing media industry, an ode to sisterhood, and a profound exploration of what it means to chase your dreams.",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B600%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/0092943605732_p0_v1_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B600x10000%5D&sink=format%5Bwebp%5D",
      "price": 56,
      "stock":121 ,
      "discount": 12,
      "rating": 4.2,
      "reviews": [
        {
          "userEmail": "ujjol@gail.com",
          "name": "ujjol",
          "review": "I seriously enjoyed this book even though when I started it I was convinced it’s not my type of story-so wrong! This was a very entertaining story from the beginning and then 2 chemists fall in love, Elizabeth knew how smart she was and could not ever be persuaded to do things any way but her way, Calvin was even smarter but he always made sure she knew he believed in her. It’s set back in the time when women were expected to stay home and have babies, she didn’t want that. There also was a dog named Six Thirty who should have his own story since he was so entertaining. There were many times I laughed out loud and this one had the best ending. Thank you Netgalley and the publisher for the ARC! Amazing!!!",
          "rating":5
        }
      ]
    },
    {
      "title": "Pete the Cat Doll: 14.5 inch",
      

      "supplier": "Ellen Marie Wiseman",
      "description": "Sage Winters always knew her sister was a little different even though they were identical twins. They loved the same things and shared a deep understanding, but Rosemary—awake to every emotion, easily moved to joy or tears—seemed to need more protection from the world.Six years after Rosemary’s death from pneumonia, Sage, now sixteen, still misses her deeply. Their mother perished in a car crash, and Sage’s stepfather, Alan, resents being burdened by a responsibility he never wanted. Yet despite living as near strangers in their Staten Island apartment, Sage is stunned to discover that Alan has kept a shocking secret: Rosemary didn’t die. She was committed to Willowbrook State School and has lingered there until just a few days ago, when she went missing.Sage knows little about Willowbrook. It’s always been a place shrouded by rumor and mystery. A place local parents threaten to send misbehaving kids. With no idea what to expect, Sage secretly sets out for Willowbrook, determined to find Rosemary. What she learns, once she steps through its doors and is mistakenly believed to be her sister, will change her life in ways she never could imagined . . .",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&source=url%5Bhttps://prodimage.images-bn.com/pimages/9781579822699_p0_v1_s600x595.jpg%5D&scale=options%5Blimit%5D,size%5B300x10000%5D&sink=format%5Bwebp%5D",
      "price": 87,
      "stock":98 ,
      "discount": 15,
      "rating": 4.7,
      "reviews": [
        {
          "userEmail": "borkot@gmail.com",
          "name": "borkot",
          "review": "Very enjoyable book. Perfect job of portraying an intelligent woman who had to be independent due to family issues and stood her ground in many situations. Brings together career, relationship and multiple other issues faced by women for years. Realistic read which I am glad was on my book club’s schedule.",
          "rating":3.9
        }
      ]
    },
    {
      "title": "Once Upon a Broken Heart (B&N Exclusive Edition)",
      "supplier": "Stephanie Garber",

      "description": "Desperate to stop the wedding and to heal her wounded heart, Evangeline strikes a deal with the charismatic, but wicked, Prince of Hearts. In exchange for his help, he asks for three kisses, to be given at the time and place of his choosing.But after Evangeline’s first promised kiss, she learns that bargaining with an immortal is a dangerous game — and that the Prince of Hearts wants far more from her than she’d pledged. He has plans for Evangeline, plans that will either end in the greatest happily ever after, or the most exquisite tragedy...",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0035051556220_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 13,
      "stock":44 ,
      "discount": 11,
      "rating": 4.7,
      "reviews": [
        {
          "userEmail": "alamin@gmail.com",
          "name": "al-amin",
          "review": "A disappointing book and unbelievable story where each man was so flawed that it is almost comical. It is not comical because most of the men described are criminals. All except Calvin Evans who had got a Nobel prize in his twenties and then conveniently died. A book steeped in misandry. Think back to the people you know from the generation that the book is set-in. Does it ring true? This is a silly book from an author whose own mind is undeveloped. She tried to write a sister version of Forrest Gump but made Elizabeth Zott a lot less likable and far more competent: a paragon of virtue/ impossibly beautiful/ brilliant chemist etc etc. Maybe a personal wish-list for the author? Just a silly book! Ridiculous book for the on-trend reader (overloaded with feminism) from a slow-witted writer.",
          "rating":4.1
        }
      ]
    },
    {
      "title": "The Ballad of Never After (Signed B&N Exclusive Book)",
      "supplier": "Stephanie Garber",

      "description": "This Barnes & Noble Exclusive Edition is signed by Stephanie Garber, includes a bonus chapter from Jacks' POV, and has a unique cover and case stamp!The fiercely-anticipated sequel to the #1 New York Times bestseller Once Upon a Broken Heart, starring Evangeline Fox and the Prince of Hearts on a new journey of magic, mystery, and heartbreaNot every love is meant to be.After Jacks, the Prince of Hearts, betrays her, Evangeline Fox swears she'll never trust him again. Now that she’s discovered her own magic, Evangeline believes she can use it to restore the chance at happily ever after that Jacks stole away.But when a new terrifying curse is revealed, Evangeline finds herself entering into a tenuous partnership with the Prince of Hearts again. Only this time, the rules have changed. Jacks isn’t the only force Evangeline needs to be wary of. In fact, he might be the only one she can trust, despite her desire to despise him.Instead of a love spell wreaking havoc on Evangeline’s life, a murderous spell has been cast. To break it, Evangeline and Jacks will have to do battle with old friends, new foes, and a magic that plays with heads and hearts. Evangeline has always trusted her heart, but this time she’s not sure she can…",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0810558018750_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 39.99,
      "stock":122 ,
      "discount": 5,
      "rating": 4.9,
      "reviews": [
        {
          "userEmail": "joshim@gmail.com",
          "name": "joshim",
          "review": "I seriously enjoyed this book even though when I started it I was convinced it’s not my type of story-so wrong! This was a very entertaining story from the beginning and then 2 chemists fall in love, Elizabeth knew how smart she was and could not ever be persuaded to do things any way but her way, Calvin was even smarter but he always made sure she knew he believed in her. It’s set back in the time when women were expected to stay home and have babies, she didn’t want that. There also was a dog named Six Thirty who should have his own story since he was so entertaining. There were many times I laughed out loud and this one had the best ending. Thank you Netgalley and the publisher for the ARC! Amazing!!!",
          "rating":5
        }
      ]
    },
    {
      "title": "Where the Crawdads Sing",
      "supplier": "by Delia Owens",

      "description": "NOW A MAJOR MOTION PICTURE—The #1 New York Times bestselling worldwide sensation with more than 15 million copies sold, hailed by The New York Times Book Review as “a painfully beautiful first novel that is at once a murder mystery, a coming-of-age narrative and a celebration of nature.”For years, rumors of the “Marsh Girl” have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life—until the unthinkable happens.Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0894769000216_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 20.87,
      "stock":56 ,
      "discount":12,
      "rating": 5,
      "reviews": [
        {
          "userEmail": "kibria@gmail.com",
          "name": "golam kibria",
          "review": "Easy read, but fascinating in that the protagonist is practical, highly intelligent, and doesn't need a man. Centered around food science, an unusual tapestry, this is a refreshing bit of summer reading.",
          "rating":3 
        }
      ]
    },
    {
      "title": "Skandar and the Unicorn Thief (B&N Exclusive Edition)",
      "supplier": "by A.F. Steadman",
      "description": "Skandar Smith has always yearned to leave the Mainland and escape to the secretive Island, where wild unicorns roam free. He's spent years studying for his Hatchery exam, the annual test that selects a handful of Mainlander thirteen-year-olds to train to become unicorn riders. But on the day of Skandar's exam, things go horribly wrong, and his hopes are shattered…until a mysterious figure knocks on his door at midnight, bearing a message: the Island is in peril and Skandar must answer its call.",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/3558380029564_p0_v4%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 19.99,
      "stock":129 ,
      "discount": 5.1,
      "rating": 4.9,
      "reviews": [
        {
          "userEmail": "kaml@gmail.com",
          "name": "kamal",
          "review": "My 4.5 star review of Lessons in Chemistry by Bonnie Garmus I should like to thank Doubleday Books and NetGalley for providing me with an advanced reader copy in return for an honest review.I ended up giving this 4.5 stars. There were parts where I felt it was too wordy but overall got better and better as the book went along. This has everything ... romance, suspense, feminism and the list goes on. Thank you for a book that shows how were women were undermined and not given credit for their work. If I had a daughter that read this and said I want to be Elizabeth Zott when I grow up', that is the highest praise I can give this book and the wonderful writing. I laughed, I cried, I kept screaming 'No' and breathing a sigh of relief when it all turned out just fine.You don't need to be a science expert to read this. Elizabeth Zott our protagonist does a wonderful job of teaching us Chemistry. If I had encountered a teacher like her, I might have liked science much more than I did.",
          "rating":4.1
        }
      ]
    },
    {
      "title": "The Hacienda",
      "supplier": "Isabel Cañas",
      "description": "When Rodolfo returns to work in the capital, visions and voices invade Beatriz’s sleep. The weight of invisible eyes follows her every move. Rodolfo’s sister, Juana, scoffs at Beatriz’s fears—but why does she refuse to enter the house at night? Why does the cook burn copal incense at the edge of the kitchen and mark the doorway with strange symbols? What really happened to the first Doña Solórzano?Beatriz only knows two things for certain: Something is wrong with the hacienda. And no one there will save heDesperate for help, she clings to the young priest, Padre Andrés, as an ally. No ordinary priest, Andrés will have to rely on his skills as a witch to fight off the malevolent presence haunting the hacienda and protect the woman for whom he feels a powerful, forbidden attraction. But even he might not be enough to battle the darkness.",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0889698548038_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 13.99,
      "stock":86 ,
      "discount": 0,
      "rating": 3.9,
      "reviews": [
        {
          "userEmail": "kader@gmail.com",
          "name": "kader",
          "review": "Elizabeth Zott is a brilliant chemist who ends up hosting an afternoon television cooking. The how she got there and what she does once she is there are the central plot of this slow burn novel.",
          "rating":4.4
        }
      ]
    },
    {
      "title": "Daughter of the Moon Goddess",
      "supplier": "Sue Lynn Tan",
      "description": "Growing up on the moon, Xingyin is accustomed to solitude, unaware that she is being hidden from the feared Celestial Emperor who exiled her mother for stealing his elixir of immortality. But when Xingyin’s magic flares and her existence is discovered, she is forced to flee her home, leaving her mother behind.Alone, powerless, and afraid, she makes her way to the Celestial Kingdom, a land of wonder and secrets. Disguising her identity, she seizes an opportunity to learn alongside the emperor’s son, mastering archery and magic, even as passion flames between her and the prince.To save her mother, Xingyin embarks on a perilous quest, confronting legendary creatures and vicious enemies. But when treachery looms and forbidden magic threatens the kingdom, she must challenge the ruthless Celestial Emperor for her dream—striking a dangerous bargain in which she is torn between losing all she loves or plunging the realm into chaos. Daughter of the Moon Goddess begins an enchanting duology which weaves ancient Chinese mythology into a sweeping adventure of immortals and magic, of loss and sacrifice—where love vies with honor, dreams are fraught with betrayal, and hope emerges triumphan",

      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0714043011755_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 13.0,
      "stock":130 ,
      "discount": 5,
      "rating":4.8,
      "reviews": [
        {
          "userEmail": "hasan@gmail.com",
          "name": "hasan",
          "review": "Honestly, I didn’t think I liked this book at first, but it grew on me and I found I kept thinking about the characters and what was going to happen next, which I dare say is the goal of any author! A 1960’s professional woman might be some kind of oxymoron, but these ladies, like our main character, were the rebels who broke through the cultural sexism and helped women achieve their goals, however traditionally ‘unladylike’ they may be. Although Elizabeth was anything but affectionate, this book had a lot of heart and by the end resonated with women everywhere, regardless of time or place. Besides that, there was actually chemistry written within these pages and enfolded in the story itself and I feel a bit smarter having read it! I also uncovered a brilliant quote from Elizabeth, aka Garmus that I’ll be displaying on the wall in the STEM Lab where I’ll be teaching this year which says, “Scientists expect mistakes, and because of it, we embrace failure”, since, as we know, this is where the learning begins. A Lesson in Chemistry, and a lesson in life.",
          "rating":4.7
        }
      ]
    },
    {
      "title": "Book of Night (B&N Exclusive Edition)",
      "supplier": "Holly Black",
      "description": "Charlie Hall is trying to distance herself from the powerful and dangerous underground world of shadow trading, but she can’t seem to escape this maelstrom of doppelgängers, thieves, and magic. Manipulating shadows has a cost, and Charlie is about to be swept up in a battle for its secrets. Holly Black’s adult dark fantasy debut is everything you loved about The Cruel Prince series, now for adults",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0889698639835_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 21.99,
      "stock":126 ,
      "discount": 4,
      "rating": 4.8,
      "reviews": [
        {
          "userEmail": "badol@gmail.com",
          "name": "badol",
          "review": "Bonnie Garmus has created a heroine to admire in Elizabeth Zott, a female chemist struggling to earn a living and thrive in the misogynistic early 1960s Southern California workforce. There are plenty of moments in this book where you’ll find yourself *very* frustrated by the circumstances Elizabeth faces, and you may question some of her decisions at times, but you’ll never stop rooting for her and her plucky supporting cast (her dog will absolutely win your heart). In the spirit of Zott’s delightful cooking show, I’d say that Lessons in Chemistry is made up of one cup historical fiction, a heaping tablespoon of feminism, a pinch of romance, and a sprinkling of quirky characters to taste—though Zott, as a scientist, would surely provide those measurements in metric units.",
          "rating":4.6 
        }
      ]
    },
    {
      "title": "Eleanor Oliphant Is Completely Fine",
      "supplier": " Gail Honeyman",
      "description": "1 NEW YORK TIMES BESTSELLER AND THE PERFECT HOLIDAY GIFT  A Reese Witherspoon Book Club Pick 'Beautifully written and incredibly funny, Eleanor Oliphant Is Completely Fine is about the importance of friendship and human connection. I fell in love with Eleanor, an eccentric and regimented loner whose life beautifully unfolds after a chance encounter with a stranger; I think you will fall in love, too!” —Reese Witherspoo No one’s ever told Eleanor that life should be better than fine. Meet Eleanor Oliphant: She struggles with appropriate social skills and tends to say exactly what she’s thinking. Nothing is missing in her carefully timetabled life of avoiding social interactions, where weekends are punctuated by frozen pizza, vodka, and phone chats with Mummy.But everything changes when Eleanor meets Raymond, the bumbling and deeply unhygienic IT guy from her office. When she and Raymond together save Sammy, an elderly gentleman who has fallen on the sidewalk, the three become the kinds of friends who rescue one another from the lives of isolation they have each been living. And it is Raymond’s big heart that will ultimately help Eleanor find the way to repair her own profoundly damaged one.Soon to be a major motion picture produced by Reese Witherspoon, Eleanor Oliphant Is Completely Fine is the smart, warm,and uplifting story of an out-of-the-ordinary heroine whose deadpan weirdness and unconscious wit make for an irresistible journey as she realizes. The only way to survive is to open your heart.",
      "img": "https://prodimage.images-bn.com/lf?set=key%5Bresolve.pixelRatio%5D,value%5B1%5D&set=key%5Bresolve.width%5D,value%5B300%5D&set=key%5Bresolve.height%5D,value%5B10000%5D&set=key%5Bresolve.imageFit%5D,value%5Bcontainerwidth%5D&set=key%5Bresolve.allowImageUpscaling%5D,value%5B0%5D&set=key%5Bresolve.format%5D,value%5Bwebp%5D&product=path%5B/pimages/0889698639828_p0_v1%5D&call=url%5Bfile:common/decodeProduct.chain%5D",
      "price": 16.99,
      "stock":145 ,
      "discount": 3,
      "rating": 5,
      "reviews": [
        {
          "userEmail": "anik@gmail.com",
          "name": "anik",
          "review": "I picked up this ARC because I thought it would be a fun romance book as the title and cover seem to suggest. However this book is so much more than that. It does have elements of romance as our main character Elizabeth Zott falls in love. Elizabeth is not a normal woman by sixties standards she doesn't want to get married or have kids or be the dutiful housewife that was expected at the time. Instead she wants to focus on her research as a chemist. However as previously mentioned it's the 60s she faces many challenges in her field mainly stemming from sexism and the belief that women had to sleep their way to the top to get to the career positions that they want. This hurts her ability to do just about everything in her field it only worsens when she realizes she's pregnant and unmarried. She struggles to find the money to provide until she gets a job as a daytime TV chef even then she isn't taken seriously by men or people in positions of power. Even though at fir",
          "rating":4.1 
        }
      ]
    }
  ]
  